# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"

# Languages
cask "java"
## Clojure
brew "clojure"
brew "leiningen"
## Scala
brew "scala"
brew "sbt"
## .NET
cask "dotnet"
cask "dotnet-sdk"
brew "mono"
## Javascript
brew "node"
brew "yarn", link: false

# Build
brew "autoconf"
brew "automake"
brew "coreutils"

# Shell
cask "iterm2"
brew "zsh"
brew "zsh-completions"

# Git
brew "git"
brew "git-lfs"
brew "hub"

# Utilities
brew "archey"
brew "cowsay"
cask "docker"
brew "emacs"
brew "ffmpeg"
brew "gnupg"
brew "htop"
brew "imagemagick"
brew "iperf"
brew "openssl"
brew "p7zip"
brew "speedtest-cli"
brew "the_silver_searcher"
brew "timewarrior"
brew "trash"
brew "tree"
brew "wget"

# Other
cask "dashlane"
cask "discord"
cask "etcher"
cask "flux"
cask "google-chrome"
cask "google-hangouts"
cask "mactex"
cask "visual-studio-code"
cask "vlc"
cask "caskroom/fonts/font-iosevka"